Thesis/thesis.org
#+LATEX_CLASS: report
#+LATEX_COMPILER: xelatex

* ProjectHunt-选题
** My Personal Taste
- Dislike :: AI stuff(Unpredictable/Python Stuff)/Bio Relate(Unpredictable/Bio Expriment)/Only Hardware(Unstable/Lack Experience and Equipment)
- Goals :: Simplicity and Fun/General Purpose/Job Relate(linux, low-level, controlable, reproducible)
  *GPT Gives Decent Some Projects*
  + Eink-Phone :: PCB, LinuxDriver, ProjectBase, Hardware
  + eBPF-Monitor :: LinuxKernel, Network, Simple
  + Minimalist Home Server :: Linux Server Management, Nginx, Docker, Bash Scripting
  + Custom Linux Kernel with Performance Monitoring :: Kernel Development, eBPF, Performance Optimization
  + CLI-Based Personal Assistant :: Shell Scripting, Python/Rust/Go, Text Processing
  + Network Traffic Analyzer using eBPF :: eBPF, Network Protocols, Linux Kernel Internals
  + Custom Linux Distro (Minimalist) :: Linux Kernel, Packaging, Distribution Building (Yocto, Buildroot)
  + Raspberry Pi Security System :: Linux Driver Development, IoT, Video Streaming, Python/C
  + Filesystem Benchmarking Tool :: Linux, System Programming, File Systems, Performance Analysis
  + USB Device Monitoring Tool using eBPF :: eBPF, Kernel Modules, Device Drivers, USB Protocols
  + Lightweight and Privacy-Focused Web Browser :: C/C++, Rust, Web Protocols, Security
  + Custom IoT Device with Linux and eBPF :: IoT, eBPF, Linux, Networking, Sensors

I'd like to try *eink-phone* which looks pretty cool and trains my skills.
Although making a smartphone is hard, it can help me to understand the whole process which connecting my knowledge dots and can be some useful thing, if I making it come true, carry out with a diy phone should be a AMAZED.

** Layer of This Project

small-simplicity-stupid
against
sport-social media-sex

App: mp3 player, +texting, phone call+, time schedule, +ai ask+,  payment, PPG 
OS: nixos
Lang: Zig

* Essential Env & Anlysis- 环境与分析
** reproducible enviroment setup
*** [[https://github.com/the-nix-way/dev-templates][Language env]] setup
+ Latex :: Emacs Org-mode to latex, then latex to [[https://github.com/coding-tan/CQUPTtex][CQUPTtex]]
+ Nix :: Github CI/CD and OS build
+ Rust :: Mainly using for Cult Belief
+ C :: Device Driver
+ C++ :: too above
+ Bash :: write a Script for fasting test
*** Build  System
[[https://github.com/mobile-nixos/mobile-nixos][mobile-nixos]]
[[https://github.com/nix-community/nixos-anywhere][nixos-anywhere]]


** Step by Step
*** Time Agenda
- When Begin?
  After Mastering Emacs Todo.



** Other
s People's Work
+ [[https://oshwhub.com/lovelessing/d133-mobile-phone-development-bo][基于D133的智能手机]]
+ [[https://oshwhub.com/honglin/First_CRT_SmartPhone][【很新但很旧】如何用最古老的技术造一台现代手机？]]
+ [[https://oshwhub.com/qzc13457/qpad][模块化平板电脑-QPad]]
+ [[https://oshwhub.com/zwxb/based-on-rk3566-taishan-pie-dolp][泰山派通话智能手机设计]]
+ [[https://oshwhub.com/li-chuang-kai-fa-ban/tai-shan-pai-pang-niu-shou-ji-kuo-zhan-ban][【胖妞手机】泰山派RK3566开发板]]
+ [[https://oshwhub.com/ludas/mo-shui-ping-qu-dong][墨水屏Eink通用驱动板【验证通过】 - 立创开源硬件平台]]
+ [[https://oshwhub.com/jie326513988/ESP32mi-ni-mo-shui-ping-MP3shou-][ESP32墨水屏MP3收音机阅读器 - 立创开源硬件平台]]
+ [[https://oshwhub.com/shukkkk/4-2-mo-shui-ping_copy_copy_copy][墨水屏TF卡电子书源码开源 - 立创开源硬件平台]]
+ [[https://www.hackster.io/news/the-zerophone-a-linux-smartphone-powered-by-the-raspberry-pi-zero-286f36a25fd4][The ZeroPhone, a Linux Smartphone Powered by the Raspberry Pi Zero - Hackster.io]]
+ [[https://github.com/evanman83/OURS-project][evanman83/OURS-project: Step-by-step instructions to build a smartphone that is open-source, upgradeable, repairable, and Big Tech free.]]

* Impletation-实现过程
** Project Steps 

*** Step 1: Understand the Basics
*Goals: Learn the fundamentals of hardware, Linux systems, and drivers.*
- *Learn Embedded Systems*: Understand how microcontrollers and processors work.
  - *Start Point*: Study ARM-based SoCs or RISC-V boards.
  - *Tools*: Raspberry Pi or ESP32 for prototyping.
- *Understand NixOS Basics*: Learn how NixOS configurations work, especially for embedded systems.
  - *Resources*: [NixOS manual](https://nixos.org/).

