Thesis/thesis.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-10 Tue 16:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgee52513">1. ProjectHunt-选题</a>
<ul>
<li><a href="#org06f7dd5">1.1. My Personal Taste</a></li>
<li><a href="#org9ea17d3">1.2. Layer of This Project</a></li>
</ul>
</li>
<li><a href="#orgf44669a">2. Essential Env &amp; Anlysis- 环境与分析</a>
<ul>
<li><a href="#orgf4171dd">2.1. reproducible enviroment setup</a>
<ul>
<li><a href="#org1f79311">2.1.1. Language env setup</a></li>
<li><a href="#org610aaab">2.1.2. Build  System</a></li>
</ul>
</li>
<li><a href="#org66a109d">2.2. Step by Step</a>
<ul>
<li><a href="#org4b41b3c">2.2.1. Time Agenda</a></li>
</ul>
</li>
<li><a href="#org8b6dc5f">2.3. Others People's Work</a></li>
</ul>
</li>
<li><a href="#org219b9e6">3. Impletation-实现过程</a>
<ul>
<li><a href="#org103bdbd">3.1. Project Steps</a>
<ul>
<li><a href="#orgeaec6be">3.1.1. Step 1: Understand the Basics</a></li>
<li><a href="#org206ec83">3.1.2. Step 2: Hardware Selection</a></li>
<li><a href="#org74f220c">3.1.3. Step 4: Prototype and Test Software</a></li>
<li><a href="#org76d8a6e">3.1.4. Step 5: Iterate the Design</a></li>
<li><a href="#org0ea8135">3.1.5. Step 6: Documentation and Optimization</a></li>
<li><a href="#orga2d70ea">3.1.6. 5-Month Learning and Implementation Plan</a></li>
<li><a href="#orgf47b701">3.1.7. ShouldYou Replicate Existing Work?</a></li>
<li><a href="#orge8abf7c">3.1.8. Key Skills to Focus On</a></li>
<li><a href="#org950b91c">3.1.9. 最最最重要的参考资料</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0be8249">4. Thesis-基于电子墨水屏的极简智能手机：面向健康监测与数字生活的创新探索</a>
<ul>
<li><a href="#orgd9a0c6d">4.1. 摘要</a></li>
<li><a href="#org0a1941d">4.2. 第一章引言</a></li>
<li><a href="#orgd1d6354">4.3. 第二章 理论基础</a></li>
<li><a href="#org3c26d0f">4.4. 第三章 硬件设计</a></li>
<li><a href="#orgd754c35">4.5. 第四章 软件开发</a></li>
<li><a href="#org7374512">4.6. 第五章 实验结果与分析</a></li>
<li><a href="#orgf744174">4.7. 第六章 结论与展望</a></li>
<li><a href="#org61bed3a">4.8. 附录</a></li>
<li><a href="#org9fc806a">4.9. 参考文献</a></li>
<li><a href="#org50fb441">4.10. 作者简介</a>
<ul>
<li><a href="#org7b6d996">4.10.1. 基本情况</a></li>
<li><a href="#orgd86bc49">4.10.2. 教育和工作经历</a></li>
</ul>
</li>
<li><a href="#org69509d7">4.11. 攻读学位期间的研究成果</a>
<ul>
<li><a href="#org72a5785">4.11.1. 发表的学术论文和著作</a></li>
<li><a href="#org024d8e0">4.11.2. 申请（授权）专利</a></li>
</ul>
</li>
<li><a href="#orga5a39b7">4.12. 致谢</a></li>
</ul>
</li>
<li><a href="#org582324f">5. Presentation-系统实现与挑战</a>
<ul>
<li><a href="#org2a30194">5.1. 系统需求分析</a></li>
<li><a href="#org11f7515">5.2. 开发环境与工具</a></li>
<li><a href="#org060f61d">5.3. 设计与实现挑战</a></li>
<li><a href="#org38a0477">5.4. 学到的经验</a></li>
<li><a href="#org8b0c155">5.5. 本章小结</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgee52513" class="outline-2">
<h2 id="orgee52513"><span class="section-number-2">1.</span> ProjectHunt-选题</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org06f7dd5" class="outline-3">
<h3 id="org06f7dd5"><span class="section-number-3">1.1.</span> My Personal Taste</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt>Dislike</dt><dd>AI stuff(Unpredictable/Python Stuff)/Bio Relate(Unpredictable/Bio Expriment)/Only Hardware(Unstable/Lack Experience and Equipment)</dd>
<dt>Goals</dt><dd>Simplicity and Fun/General Purpose/Job Relate(linux, low-level, controlable, reproducible)
<b>GPT Gives Decent Some Projects</b>
<dl class="org-dl">
<dt>Eink-Phone</dt><dd>PCB, LinuxDriver, ProjectBase, Hardware</dd>
<dt>eBPF-Monitor</dt><dd>LinuxKernel, Network, Simple</dd>
<dt>Minimalist Home Server</dt><dd>Linux Server Management, Nginx, Docker, Bash Scripting</dd>
<dt>Custom Linux Kernel with Performance Monitoring</dt><dd>Kernel Development, eBPF, Performance Optimization</dd>
<dt>CLI-Based Personal Assistant</dt><dd>Shell Scripting, Python/Rust/Go, Text Processing</dd>
<dt>Network Traffic Analyzer using eBPF</dt><dd>eBPF, Network Protocols, Linux Kernel Internals</dd>
<dt>Custom Linux Distro (Minimalist)</dt><dd>Linux Kernel, Packaging, Distribution Building (Yocto, Buildroot)</dd>
<dt>Raspberry Pi Security System</dt><dd>Linux Driver Development, IoT, Video Streaming, Python/C</dd>
<dt>Filesystem Benchmarking Tool</dt><dd>Linux, System Programming, File Systems, Performance Analysis</dd>
<dt>USB Device Monitoring Tool using eBPF</dt><dd>eBPF, Kernel Modules, Device Drivers, USB Protocols</dd>
<dt>Lightweight and Privacy-Focused Web Browser</dt><dd>C/C++, Rust, Web Protocols, Security</dd>
<dt>Custom IoT Device with Linux and eBPF</dt><dd>IoT, eBPF, Linux, Networking, Sensors</dd>
</dl></dd>
</dl>

<p>
I'd like to try <b>eink-phone</b> which looks pretty cool and trains my skills.
Although making a smartphone is hard, it can help me to understand the whole process which connecting my knowledge dots and can be some useful thing, if I making it come true, carry out with a diy phone should be a AMAZED.
</p>
</div>
</div>
<div id="outline-container-org9ea17d3" class="outline-3">
<h3 id="org9ea17d3"><span class="section-number-3">1.2.</span> Layer of This Project</h3>
<div class="outline-text-3" id="text-1-2">
<p>
small-simplicity-stupid
against
sport-social media-sex
</p>

<p>
App: mp3 player, texting, phone call, time schedule, ai ask, payment, PPG 
OS: nixos
Lang: Zig
</p>
</div>
</div>
</div>
<div id="outline-container-orgf44669a" class="outline-2">
<h2 id="orgf44669a"><span class="section-number-2">2.</span> Essential Env &amp; Anlysis- 环境与分析</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf4171dd" class="outline-3">
<h3 id="orgf4171dd"><span class="section-number-3">2.1.</span> reproducible enviroment setup</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org1f79311" class="outline-4">
<h4 id="org1f79311"><span class="section-number-4">2.1.1.</span> <a href="https://github.com/the-nix-way/dev-templates">Language env</a> setup</h4>
<div class="outline-text-4" id="text-2-1-1">
<dl class="org-dl">
<dt>Latex</dt><dd>Emacs Org-mode to latex, then latex to <a href="https://github.com/coding-tan/CQUPTtex">CQUPTtex</a></dd>
<dt>Nix</dt><dd>Github CI/CD and OS build</dd>
<dt>Rust</dt><dd>Mainly using for Cult Belief</dd>
<dt>C</dt><dd>Device Driver</dd>
<dt>C++</dt><dd>too above</dd>
<dt>Bash</dt><dd>write a Script for fasting test</dd>
</dl>
</div>
</div>
<div id="outline-container-org610aaab" class="outline-4">
<h4 id="org610aaab"><span class="section-number-4">2.1.2.</span> Build  System</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
<a href="https://github.com/mobile-nixos/mobile-nixos">mobile-nixos</a>
<a href="https://github.com/nix-community/nixos-anywhere">nixos-anywhere</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org66a109d" class="outline-3">
<h3 id="org66a109d"><span class="section-number-3">2.2.</span> Step by Step</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org4b41b3c" class="outline-4">
<h4 id="org4b41b3c"><span class="section-number-4">2.2.1.</span> Time Agenda</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>When Begin?
After Mastering Emacs Todo.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8b6dc5f" class="outline-3">
<h3 id="org8b6dc5f"><span class="section-number-3">2.3.</span> Others People's Work</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li><a href="https://oshwhub.com/lovelessing/d133-mobile-phone-development-bo">基于D133的智能手机</a></li>
<li><a href="https://oshwhub.com/honglin/First_CRT_SmartPhone">【很新但很旧】如何用最古老的技术造一台现代手机？</a></li>
<li><a href="https://oshwhub.com/qzc13457/qpad">模块化平板电脑-QPad</a></li>
<li><a href="https://oshwhub.com/zwxb/based-on-rk3566-taishan-pie-dolp">泰山派通话智能手机设计</a></li>
<li><a href="https://oshwhub.com/li-chuang-kai-fa-ban/tai-shan-pai-pang-niu-shou-ji-kuo-zhan-ban">【胖妞手机】泰山派RK3566开发板</a></li>
<li><a href="https://oshwhub.com/ludas/mo-shui-ping-qu-dong">墨水屏Eink通用驱动板【验证通过】 - 立创开源硬件平台</a></li>
<li><a href="https://oshwhub.com/jie326513988/ESP32mi-ni-mo-shui-ping-MP3shou-">ESP32墨水屏MP3收音机阅读器 - 立创开源硬件平台</a></li>
<li><a href="https://oshwhub.com/shukkkk/4-2-mo-shui-ping_copy_copy_copy">墨水屏TF卡电子书源码开源 - 立创开源硬件平台</a></li>
<li><a href="https://www.hackster.io/news/the-zerophone-a-linux-smartphone-powered-by-the-raspberry-pi-zero-286f36a25fd4">The ZeroPhone, a Linux Smartphone Powered by the Raspberry Pi Zero - Hackster.io</a></li>
<li><a href="https://github.com/evanman83/OURS-project">evanman83/OURS-project: Step-by-step instructions to build a smartphone that is open-source, upgradeable, repairable, and Big Tech free.</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org219b9e6" class="outline-2">
<h2 id="org219b9e6"><span class="section-number-2">3.</span> Impletation-实现过程</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org103bdbd" class="outline-3">
<h3 id="org103bdbd"><span class="section-number-3">3.1.</span> Project Steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgeaec6be" class="outline-4">
<h4 id="orgeaec6be"><span class="section-number-4">3.1.1.</span> Step 1: Understand the Basics</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
<b>Goals: Learn the fundamentals of hardware, Linux systems, and drivers.</b>
</p>
<ul class="org-ul">
<li><b>Learn Embedded Systems</b>: Understand how microcontrollers and processors work.
<ul class="org-ul">
<li><b>Start Point</b>: Study ARM-based SoCs or RISC-V boards.</li>
<li><b>Tools</b>: Raspberry Pi or ESP32 for prototyping.</li>
</ul></li>
<li><b>Understand NixOS Basics</b>: Learn how NixOS configurations work, especially for embedded systems.
<ul class="org-ul">
<li><b>Resources</b>: [NixOS manual](<a href="https://nixos.org/">https://nixos.org/</a>).</li>
</ul></li>
</ul>
</div>
</div>
