Thesis/thesis.html
<div id="outline-container-org206ec83" class="outline-4">
<h4 id="org206ec83"><span class="section-number-4">3.1.2.</span> Step 2: Hardware Selection</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
<b>Goals: Choose hardware components for your phone.</b>
</p>
<ol class="org-ol">
<li><b>Processor</b>: Start with something well-documented, like Raspberry Pi Compute Module or Pine64 SoCs.</li>
<li><b>Screen</b>: Use a 1.54-inch e-ink display module (check [Waveshare e-ink modules](<a href="https://www.waveshare.com/">https://www.waveshare.com/</a>)).</li>
<li><b>Buttons</b>: Choose simple GPIO-connected buttons.</li>
<li><b>Audio</b>: Look into I2S-based DACs for audio output.</li>
<li><b>Communication Modules</b>: GSM/4G modules for calls and SMS (e.g., SIM800 or SIM7600).</li>
<li><b>Battery</b>: Incorporate a LiPo battery and charging ICs (e.g., TP4056).</li>
</ol>


<p>
<b><b>Goals: Write and understand drivers for hardware components.</b></b>
</p>
<ol class="org-ol">
<li><b><b>Start with Simple Drivers</b></b>:
<ul class="org-ul">
<li>Use an e-ink display as your first driver project.</li>
<li><b><b>Steps</b></b>: Read its datasheet, understand the communication protocol (SPI/I2C), and write a driver.</li>
<li><b><b>Resources</b></b>: 
<ul class="org-ul">
<li>[Linux Device Drivers book](<a href="https://lwn.net/Kernel/LDD3/">https://lwn.net/Kernel/LDD3/</a>) (focus on basic driver examples).</li>
<li>Tutorials like [Eudyptula Challenge](<a href="https://eudyptula-challenge.org/">https://eudyptula-challenge.org/</a>).</li>
</ul></li>
</ul></li>
<li><b><b>Progress to GSM Modules</b></b>:
<ul class="org-ul">
<li>Learn AT commands to control GSM modules.</li>
<li>Write a driver to interface with your SoC.</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org74f220c" class="outline-4">
<h4 id="org74f220c"><span class="section-number-4">3.1.3.</span> Step 4: Prototype and Test Software</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
<b>Goals: Build essential apps on a minimal NixOS setup.</b>
</p>
<ol class="org-ol">
<li><b>Minimal NixOS Setup</b>:
<ul class="org-ul">
<li>Configure NixOS to boot on your chosen hardware.</li>
<li>Use the [Mobile NixOS project](<a href="https://mobile.nixos.org/">https://mobile.nixos.org/</a>) as a reference.</li>
</ul></li>
<li><b>Write Simple Applications</b>:
<ul class="org-ul">
<li><b>Phone Dialer</b>: Use a terminal or simple UI (e.g., GTK, SDL).</li>
<li><b>Text Messaging</b>: Implement SMS send/receive using GSM module libraries.</li>
<li><b>Music Player</b>: Parse and play MP3 files using libraries like [libmpg123](<a href="https://www.mpg123.de/">https://www.mpg123.de/</a>).</li>
<li><b>AI Assistant</b>: Start with lightweight offline tools like [OpenAI Whisper](<a href="https://github.com/openai/whisper">https://github.com/openai/whisper</a>) or other TTS/voice command solutions.</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org76d8a6e" class="outline-4">
<h4 id="org76d8a6e"><span class="section-number-4">3.1.4.</span> Step 5: Iterate the Design</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
<b>Goals: Integrate components into a polished prototype.</b>
</p>
<ol class="org-ol">
<li><b>PCB Design</b>:
<ul class="org-ul">
<li>Use software like KiCad to design and produce a custom PCB for your components.</li>
<li>Include GPIOs for buttons and connectors for the screen and GSM module.</li>
</ul></li>
<li><b>Integrate Software and Hardware</b>:
<ul class="org-ul">
<li>Debug drivers and apps as you integrate components.</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-org0ea8135" class="outline-4">
<h4 id="org0ea8135"><span class="section-number-4">3.1.5.</span> Step 6: Documentation and Optimization</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
<b>Goals: Create a streamlined, reproducible setup.</b>
</p>
<ol class="org-ol">
<li><b>Optimize Apps</b>:
<ul class="org-ul">
<li>Use Rust or Zig for efficient and secure programming.</li>
<li>Ensure apps are lightweight to match the hardware.</li>
</ul></li>
<li><b>Document Your Work</b>:
<ul class="org-ul">
<li>Write detailed build instructions and share your design for feedback.</li>
</ul></li>
</ol>
</div>
</div>
<div id="outline-container-orga2d70ea" class="outline-4">
<h4 id="orga2d70ea"><span class="section-number-4">3.1.6.</span> 5-Month Learning and Implementation Plan</h4>
<div class="outline-text-4" id="text-3-1-6">
<ol class="org-ol">
<li><b>Month 1</b>: Learn NixOS basics, Linux drivers, and embedded systems fundamentals.</li>
<li><b>Month 2</b>: Choose hardware and write drivers for the e-ink display and buttons.</li>
<li><b>Month 3</b>: Implement GSM module integration and basic call/SMS apps.</li>
<li><b>Month 4</b>: Develop additional apps (music player, AI assistant, planner) and integrate.</li>
<li><b>Month 5</b>: Finalize hardware design, debug, and document.</li>
</ol>
</div>
</div>
<div id="outline-container-orgf47b701" class="outline-4">
<h4 id="orgf47b701"><span class="section-number-4">3.1.7.</span> ShouldYou Replicate Existing Work?</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
Yes, start by replicating simple open-source projects like:
</p>
<ol class="org-ol">
<li><b>Waveshare E-Ink Projects</b>: Learn how others interface with e-ink displays.</li>
<li><b>PinePhone Software</b>: Study the existing open-source drivers and apps for inspiration.</li>
</ol>
</div>
</div>
<div id="outline-container-orge8abf7c" class="outline-4">
<h4 id="orge8abf7c"><span class="section-number-4">3.1.8.</span> Key Skills to Focus On</h4>
<div class="outline-text-4" id="text-3-1-8">
<ol class="org-ol">
<li><b>Linux Kernel Programming</b> (for drivers).</li>
<li><b>Embedded C/C++</b>, Rust, or Zig.</li>
<li><b>PCB Design</b> (KiCad).</li>
<li><b>NixOS Embedded Configuration</b>.</li>
</ol>

<p>
This step-by-step approach will help you stay focused while learning the essential skills to build your own Linux phone. Let me know if you'd like detailed guidance on any of these steps!
</p>
</div>
</div>
<div id="outline-container-org950b91c" class="outline-4">
<h4 id="org950b91c"><span class="section-number-4">3.1.9.</span> 最最最重要的参考资料</h4>
<div class="outline-text-4" id="text-3-1-9">
<p>
<a href="https://oshwhub.com/li-chuang-kai-fa-ban/tai-shan-pai-pang-niu-shou-ji-kuo-zhan-ban">【胖妞手机】泰山派RK3566开发板</a>＋ <a href="https://oshwhub.com/qwqoffice/pulse-wave-and-heart-rate-display-based-on-ppg">基于PPG的脉搏波及心率显示</a> ＋ <a href="https://oshwhub.com/ludas/mo-shui-ping-qu-dong">墨水屏Eink通用驱动板</a>+ <a href="https://oshwhub.com/jie326513988/esp32c3-154-ink-screen-multi-function">ESP32C3-1.54墨水屏-多功能</a>  = <a href="http://norvig.com/21-days.html">轻松毕业</a>
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org0be8249" class="outline-2">
<h2 id="org0be8249"><span class="section-number-2">4.</span> Thesis-基于电子墨水屏的极简智能手机：面向健康监测与数字生活的创新探索</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd9a0c6d" class="outline-3">
<h3 id="orgd9a0c6d"><span class="section-number-3">4.1.</span> 摘要</h3>
<div class="outline-text-3" id="text-4-1">
<p>
本论文致力于设计一款极简、节能的智能手机，采用电子墨水屏和开源技术，旨在降低数字生活中的过度依赖，同时为用户提供健康监测功能。通过集成光电容积脉搏波（PPG）传感器，该设备能够实现心率、血压、疲劳指数、步数以及冥想状态的实时监测。本文核心贡献包括：基于Linux内核的驱动开发、Rust语言实现的高效应用程序设计、电子墨水屏刷新优化算法，以及健康监测算法在嵌入式系统中的应用。
</p>
</div>
</div>
<div id="outline-container-org0a1941d" class="outline-3">
<h3 id="org0a1941d"><span class="section-number-3">4.2.</span> 第一章引言</h3>
<div class="outline-text-3" id="text-4-2">
<p>
1.1 研究背景与意义
</p>
<ul class="org-ul">
<li>数字生活与互联网滥用的现状
<ul class="org-ul">
<li>随着智能手机和社交媒体的普及，用户花费大量时间在屏幕前，带来情绪焦虑、生产力下降以及健康问题。</li>
<li>学术研究表明，电子设备过度使用与眼部疲劳、睡眠质量下降以及心理健康问题密切相关。</li>
</ul></li>
<li>健康监测的需求
<ul class="org-ul">
<li>在后疫情时代，个人健康监测需求快速增长，基于可穿戴设备的便捷、实时健康监测成为新趋势。</li>
</ul></li>
<li>极简设计理念
<ul class="org-ul">
<li>极简设计倡导“功能至上、减少干扰”的原则，通过减少设备功能和提升用户体验，帮助用户专注于生活本身。</li>
</ul></li>
<li><p>
电子墨水屏的潜力
</p>
<ul class="org-ul">
<li>电子墨水屏具有低功耗、高可读性等优势，是实现节能和护眼设备的理想选择。</li>
</ul>

<p>
1.2 研究目标与创新点
</p></li>
<li>打造一款基于电子墨水屏的极简智能手机，兼具基本通信和健康监测功能。</li>
<li>实现PPG信号处理算法，以提供血压、心率及其他健康数据的高精度监测。</li>
<li>在嵌入式Linux系统中，通过Rust和Zig优化应用性能，探索高效的软件与硬件协同设计。</li>
</ul>
</div>
</div>
<div id="outline-container-orgd1d6354" class="outline-3">
<h3 id="orgd1d6354"><span class="section-number-3">4.3.</span> 第二章 理论基础</h3>
<div class="outline-text-3" id="text-4-3">
<p>
2.1 电子墨水屏技术
</p>
<ul class="org-ul">
<li>电子墨水屏的工作原理及刷新优化策略。</li>
<li><p>
相较传统LCD/OLED屏幕的优势，如低功耗、健康护眼和高对比度。
</p>

<p>
2.2 光电容积脉搏波（PPG）
</p></li>
<li>基本原理：通过光吸收变化检测血流量变化。</li>
<li><p>
扩展应用：
</p>
<ul class="org-ul">
<li>心率测量：从PPG波形提取心跳频率。</li>
<li>血压估算：基于PPG与脉搏波传导时间（PWTT）。</li>
<li>疲劳指数分析：通过心率变异性（HRV）评估用户疲劳状态。</li>
<li>步数监测：结合运动传感器的健康追踪。</li>
<li>冥想辅助：通过HRV变化评估冥想效果。</li>
</ul>

<p>
2.3 Linux内核与嵌入式系统
</p></li>
<li>Linux在嵌入式设备中的优势：开源灵活、可定制化。</li>
<li><p>
驱动开发基础：设备树配置、用户空间与内核空间通信。
</p>

<p>
2.4 Rust与Zig在嵌入式开发中的应用
</p></li>
<li>Rust：
<ul class="org-ul">
<li>内存安全和性能的平衡，适合资源受限的嵌入式系统。</li>
<li>强类型系统和所有权模型在驱动开发中的优势。</li>
</ul></li>
<li>Zig：
<ul class="org-ul">
<li>极简设计和直接内存控制，适合高性能嵌入式算法。</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3c26d0f" class="outline-3">
<h3 id="org3c26d0f"><span class="section-number-3">4.4.</span> 第三章 硬件设计</h3>
<div class="outline-text-3" id="text-4-4">
<p>
3.1 系统架构
</p>
<ul class="org-ul">
<li>选用H616 SoC，整合电子墨水屏、PPG传感器、电池管理芯片等。</li>
<li><p>
高级模块设计：
</p>
<ul class="org-ul">
<li>主控芯片：适配ARM架构的高效SoC。</li>
<li>显示模块：1.54英寸电子墨水屏，支持快速刷新。</li>
<li>传感器模块：高精度PPG传感器。</li>
<li>通信模块：支持4G LTE网络。</li>
<li>扩展接口：USB 3.0、GPIO、I2C等。</li>
</ul>

<p>
3.2 PCB设计与硬件实现
</p></li>
<li>PCB设计中的功耗优化与抗干扰设计。</li>
<li><p>
模块化硬件设计以支持未来升级。
</p>

<p>
3.3 3D打印外壳
</p></li>
<li>采用环保材料3D打印极简外壳。</li>
<li>结构设计优化，确保设备便携耐用。</li>
</ul>
</div>
</div>
